# NumberOfVertices Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wire..::..NumberOfVertices Property
Wire Class See Also
---
The number of vertices of the wire, including the start and end point.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public int NumberOfVertices { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfVertices As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfVertices {
	int get ();
}
```

# See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace